## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 1 to change, 8 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.etl_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "etl_policies"  {
      ~ id      = "1487291909" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/server-metrics-etl",
                          - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server",
                          - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/appstore-metrics-etl",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_appstore_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_appstore_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:005133826942:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
              ~ (known after apply),
                # (8 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_iam_policy.etl_policies will be updated in-place
  ~ resource "aws_iam_policy" "etl_policies" {
        id        = "arn:aws:iam::005133826942:policy/ETLTaskExecutionPolicies"
        name      = "ETLTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/server-metrics-etl",
                          - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/metrics-server",
                          - "arn:aws:ecr:ca-central-1:005133826942:repository/covid-server/appstore-metrics-etl",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_appstore_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_server_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_server_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_appstore_metrics_ecs:log-stream:*",
                          - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_appstore_metrics_ecs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:CreateNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:ca-central-1:005133826942:network-interface/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:DescribeNetworkInterfaces"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::unmasked-metrics-snfsv-staging",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging/*",
                          - "arn:aws:s3:::masked-metrics-snfsv-staging",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.masked_inapp_metrics.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + cpu                   = 0
                  + environment           = []
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + mountPoints           = []
                  + name                  = "log_router"
                  + portMappings          = []
                  + user                  = "0"
                  + volumesFrom           = []
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "${awslogs-region}"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/masked_inapp_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-masked-metrics"
          + "bucket_name"           = "masked-metrics-snfsv-staging"
          + "environment"           = "staging"
          + "image"                 = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
          + "mask_data"             = "True"
          + "name"                  = "masked_inapp_metrics"
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "masked_inapp_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "masked_inapp_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "masked_inapp_metrics-cw-event-rule"
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role"
      + rule           = "masked_inapp_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.masked_inapp_metrics.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/masked_inapp_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.masked_inapp_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "masked_inapp_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.masked_metrics.aws_cloudwatch_event_rule.event_rule will be destroyed
  - resource "aws_cloudwatch_event_rule" "event_rule" {
      - arn                 = "arn:aws:events:ca-central-1:005133826942:rule/masked_metrics_event_rule" -> null
      - event_bus_name      = "default" -> null
      - id                  = "masked_metrics_event_rule" -> null
      - is_enabled          = true -> null
      - name                = "masked_metrics_event_rule" -> null
      - schedule_expression = "rate(24 hours)" -> null
      - tags                = {
          - "Name" = "masked_metrics-cw-event-rule"
        } -> null
      - tags_all            = {
          - "Name" = "masked_metrics-cw-event-rule"
        } -> null
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be destroyed
  - resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      - arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics" -> null
      - event_bus_name = "default" -> null
      - id             = "masked_metrics_event_rule-terraform-20210617204945093200000002" -> null
      - role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role" -> null
      - rule           = "masked_metrics_event_rule" -> null
      - target_id      = "terraform-20210617204945093200000002" -> null

      - ecs_target {
          - launch_type         = "FARGATE" -> null
          - platform_version    = "1.4.0" -> null
          - task_count          = 1 -> null
          - task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:48" -> null

          - network_configuration {
              - assign_public_ip = false -> null
              - security_groups  = [
                  - "sg-090d16d17a0b6c2b1",
                ] -> null
              - subnets          = [
                  - "subnet-02bfc21b518d54130",
                ] -> null
            }
        }
    }

  # module.masked_metrics.aws_cloudwatch_log_group.log will be destroyed
  - resource "aws_cloudwatch_log_group" "log" {
      - arn               = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/masked_metrics_ecs" -> null
      - id                = "/aws/ecs/masked_metrics_ecs" -> null
      - name              = "/aws/ecs/masked_metrics_ecs" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def will be destroyed
  - resource "aws_ecs_task_definition" "task_def" {
      - arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:48" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "masked-metrics-snfsv-staging"
                        },
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "staging"
                        },
                      - {
                          - name  = "MASK_DATA"
                          - value = "True"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - add  = [
                              - "SYS_PTRACE",
                            ]
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/masked_metrics_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-masked-metrics"
                        }
                    }
                  - mountPoints      = []
                  - name             = "masked_metrics"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
              - {
                  - cpu                   = 0
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:latest"
                  - memory                = 128
                  - mountPoints           = []
                  - name                  = "log_router"
                  - portMappings          = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
              - {
                  - command          = [
                      - "/usr/bin/falco",
                      - "-pc",
                      - "-o",
                      - "json_output=true",
                    ]
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "falcosecurity/falco:0.17.1"
                  - logConfiguration = {
                      - logDriver = "awsfirelens"
                      - options   = {
                          - Name              = "cloudwatch"
                          - auto_create_group = "true"
                          - log_group_name    = "falco"
                          - log_stream_name   = "alerts"
                          - region            = "ca-central-1"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = [
                      - {
                          - containerPath = "/host/var/run/docker.sock"
                          - sourceVolume  = "docker-socket"
                        },
                      - {
                          - containerPath = "/host/dev"
                          - sourceVolume  = "dev-fs"
                        },
                      - {
                          - containerPath = "/host/proc"
                          - readOnly      = true
                          - sourceVolume  = "proc-fs"
                        },
                      - {
                          - containerPath = "/host/boot"
                          - readOnly      = true
                          - sourceVolume  = "boot-fs"
                        },
                      - {
                          - containerPath = "/host/lib/modules"
                          - readOnly      = true
                          - sourceVolume  = "lib-modules"
                        },
                      - {
                          - containerPath = "/host/usr"
                          - readOnly      = true
                          - sourceVolume  = "usr-fs"
                        },
                    ]
                  - name             = "falco"
                  - portMappings     = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role" -> null
      - family                   = "masked_metrics" -> null
      - id                       = "masked_metrics" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 48 -> null
      - tags                     = {
          - "CostCentre" = "CovidShield"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "CovidShield"
        } -> null
      - task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role" -> null

      - volume {
          - name = "boot-fs" -> null
        }
      - volume {
          - name = "dev-fs" -> null
        }
      - volume {
          - name = "docker-socket" -> null
        }
      - volume {
          - name = "lib-modules" -> null
        }
      - volume {
          - name = "proc-fs" -> null
        }
      - volume {
          - name = "usr-fs" -> null
        }
    }

  # module.unmasked_inapp_metrics.data.template_file.masked_metrics will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "masked_metrics"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "MASK_DATA"
                          + value = "${mask_data}"
                        },
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "${environment}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                    ]
                  + essential        = true
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + add  = [
                              + "SYS_PTRACE",
                            ]
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + mountPoints      = []
                  + name             = "${name}"
                  + portMappings     = [
                      + {
                          + containerPort = 8001
                          + hostPort      = 8001
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = []
                },
              + {
                  + cpu                   = 0
                  + environment           = []
                  + essential             = true
                  + firelensConfiguration = {
                      + options = {
                          + enable-ecs-log-metadata = "true"
                        }
                      + type    = "fluentbit"
                    }
                  + image                 = "amazon/aws-for-fluent-bit:latest"
                  + memory                = 128
                  + mountPoints           = []
                  + name                  = "log_router"
                  + portMappings          = []
                  + user                  = "0"
                  + volumesFrom           = []
                },
              + {
                  + command          = [
                      + "/usr/bin/falco",
                      + "-pc",
                      + "-o",
                      + "json_output=true",
                    ]
                  + cpu              = 10
                  + essential        = true
                  + image            = "falcosecurity/falco:0.17.1"
                  + logConfiguration = {
                      + logDriver = "awsfirelens"
                      + options   = {
                          + Name              = "cloudwatch"
                          + auto_create_group = "true"
                          + log_group_name    = "falco"
                          + log_stream_name   = "alerts"
                          + region            = "${awslogs-region}"
                        }
                    }
                  + memory           = 512
                  + mountPoints      = [
                      + {
                          + containerPath = "/host/var/run/docker.sock"
                          + sourceVolume  = "docker-socket"
                        },
                      + {
                          + containerPath = "/host/dev"
                          + sourceVolume  = "dev-fs"
                        },
                      + {
                          + containerPath = "/host/proc"
                          + readOnly      = true
                          + sourceVolume  = "proc-fs"
                        },
                      + {
                          + containerPath = "/host/boot"
                          + readOnly      = true
                          + sourceVolume  = "boot-fs"
                        },
                      + {
                          + containerPath = "/host/lib/modules"
                          + readOnly      = true
                          + sourceVolume  = "lib-modules"
                        },
                      + {
                          + containerPath = "/host/usr"
                          + readOnly      = true
                          + sourceVolume  = "usr-fs"
                        },
                    ]
                  + name             = "falco"
                },
            ]
        )
      + vars     = {
          + "awslogs-group"         = "/aws/ecs/unmasked_inapp_metrics_ecs"
          + "awslogs-region"        = "ca-central-1"
          + "awslogs-stream-prefix" = "ecs-unmasked-metrics"
          + "bucket_name"           = "unmasked-metrics-snfsv-staging"
          + "environment"           = "staging"
          + "image"                 = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
          + "mask_data"             = "False"
          + "name"                  = "unmasked_inapp_metrics"
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_rule.event_rule will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "unmasked_inapp_metrics_event_rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(24 hours)"
      + tags                = {
          + "Name" = "unmasked_inapp_metrics-cw-event-rule"
        }
      + tags_all            = {
          + "Name" = "unmasked_inapp_metrics-cw-event-rule"
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role"
      + rule           = "unmasked_inapp_metrics_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + launch_type         = "FARGATE"
          + platform_version    = "1.4.0"
          + task_count          = 1
          + task_definition_arn = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = [
                  + "sg-090d16d17a0b6c2b1",
                ]
              + subnets          = [
                  + "subnet-02bfc21b518d54130",
                ]
            }
        }
    }

  # module.unmasked_inapp_metrics.aws_cloudwatch_log_group.log will be created
  + resource "aws_cloudwatch_log_group" "log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/unmasked_inapp_metrics_ecs"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.unmasked_inapp_metrics.aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role"
      + family                   = "unmasked_inapp_metrics"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "CovidShield"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
        }
      + task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role"

      + volume {
          + name = "boot-fs"
        }
      + volume {
          + name = "dev-fs"
        }
      + volume {
          + name = "docker-socket"
        }
      + volume {
          + name = "lib-modules"
        }
      + volume {
          + name = "proc-fs"
        }
      + volume {
          + name = "usr-fs"
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_event_rule.event_rule will be destroyed
  - resource "aws_cloudwatch_event_rule" "event_rule" {
      - arn                 = "arn:aws:events:ca-central-1:005133826942:rule/unmasked_metrics_event_rule" -> null
      - event_bus_name      = "default" -> null
      - id                  = "unmasked_metrics_event_rule" -> null
      - is_enabled          = true -> null
      - name                = "unmasked_metrics_event_rule" -> null
      - schedule_expression = "rate(24 hours)" -> null
      - tags                = {
          - "Name" = "unmasked_metrics-cw-event-rule"
        } -> null
      - tags_all            = {
          - "Name" = "unmasked_metrics-cw-event-rule"
        } -> null
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be destroyed
  - resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      - arn            = "arn:aws:ecs:ca-central-1:005133826942:cluster/in-app-metrics" -> null
      - event_bus_name = "default" -> null
      - id             = "unmasked_metrics_event_rule-terraform-20210617204945092200000001" -> null
      - role_arn       = "arn:aws:iam::005133826942:role/etl-st-cw-role" -> null
      - rule           = "unmasked_metrics_event_rule" -> null
      - target_id      = "terraform-20210617204945092200000001" -> null

      - ecs_target {
          - launch_type         = "FARGATE" -> null
          - platform_version    = "1.4.0" -> null
          - task_count          = 1 -> null
          - task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:46" -> null

          - network_configuration {
              - assign_public_ip = false -> null
              - security_groups  = [
                  - "sg-090d16d17a0b6c2b1",
                ] -> null
              - subnets          = [
                  - "subnet-02bfc21b518d54130",
                ] -> null
            }
        }
    }

  # module.unmasked_metrics.aws_cloudwatch_log_group.log will be destroyed
  - resource "aws_cloudwatch_log_group" "log" {
      - arn               = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/ecs/unmasked_metrics_ecs" -> null
      - id                = "/aws/ecs/unmasked_metrics_ecs" -> null
      - name              = "/aws/ecs/unmasked_metrics_ecs" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def will be destroyed
  - resource "aws_ecs_task_definition" "task_def" {
      - arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:46" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "unmasked-metrics-snfsv-staging"
                        },
                      - {
                          - name  = "ENVIRONMENT"
                          - value = "staging"
                        },
                      - {
                          - name  = "MASK_DATA"
                          - value = "False"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                  - linuxParameters  = {
                      - capabilities = {
                          - add  = [
                              - "SYS_PTRACE",
                            ]
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/unmasked_metrics_ecs"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-unmasked-metrics"
                        }
                    }
                  - mountPoints      = []
                  - name             = "unmasked_metrics"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
              - {
                  - cpu                   = 0
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "amazon/aws-for-fluent-bit:latest"
                  - memory                = 128
                  - mountPoints           = []
                  - name                  = "log_router"
                  - portMappings          = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
              - {
                  - command          = [
                      - "/usr/bin/falco",
                      - "-pc",
                      - "-o",
                      - "json_output=true",
                    ]
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "falcosecurity/falco:0.17.1"
                  - logConfiguration = {
                      - logDriver = "awsfirelens"
                      - options   = {
                          - Name              = "cloudwatch"
                          - auto_create_group = "true"
                          - log_group_name    = "falco"
                          - log_stream_name   = "alerts"
                          - region            = "ca-central-1"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = [
                      - {
                          - containerPath = "/host/var/run/docker.sock"
                          - sourceVolume  = "docker-socket"
                        },
                      - {
                          - containerPath = "/host/dev"
                          - sourceVolume  = "dev-fs"
                        },
                      - {
                          - containerPath = "/host/proc"
                          - readOnly      = true
                          - sourceVolume  = "proc-fs"
                        },
                      - {
                          - containerPath = "/host/boot"
                          - readOnly      = true
                          - sourceVolume  = "boot-fs"
                        },
                      - {
                          - containerPath = "/host/lib/modules"
                          - readOnly      = true
                          - sourceVolume  = "lib-modules"
                        },
                      - {
                          - containerPath = "/host/usr"
                          - readOnly      = true
                          - sourceVolume  = "usr-fs"
                        },
                    ]
                  - name             = "falco"
                  - portMappings     = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::005133826942:role/container_execution_role" -> null
      - family                   = "unmasked_metrics" -> null
      - id                       = "unmasked_metrics" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 46 -> null
      - tags                     = {
          - "CostCentre" = "CovidShield"
        } -> null
      - tags_all                 = {
          - "CostCentre" = "CovidShield"
        } -> null
      - task_role_arn            = "arn:aws:iam::005133826942:role/metrics_task_execution_role" -> null

      - volume {
          - name = "boot-fs" -> null
        }
      - volume {
          - name = "dev-fs" -> null
        }
      - volume {
          - name = "docker-socket" -> null
        }
      - volume {
          - name = "lib-modules" -> null
        }
      - volume {
          - name = "proc-fs" -> null
        }
      - volume {
          - name = "usr-fs" -> null
        }
    }

Plan: 8 to add, 1 to change, 8 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>